Repository: universalcore/unicore-cms-ureport
Catalog: unicorecmsgem/locale/hin_*/LC_MESSAGES/unicorecmsgem.po
Languages: in

source: What Is The Girl Effect
in: Girl Effect क्या है?

source: Learn more about The Girl Effect
in: The Girl Effect के बारे में और जानें

source: And spread the word
in: इन शब्दों को फैल

source: Latest
in: नवीनतम

source: More
in: अधिक

source: The Girl Declaration
in: लड़कियों के घोषणा

source: Read It Now.
in: अभी पढ़ें

source: And share it with other girls
in: और उसे अन्य लड़कियों के साथ साझा करें

source: Contact
in: संपर्क

source: Terms &amp; Conditions
in: उपयोग की शर्तें

source: Tips on Use
in: उपयोग संबंधी युक्तियाँ

source: Home
in: होम पेज
