Repository: universalcore/unicore-cms-ureport
Catalog: unicorecmsgem/locale/swa_TZ/LC_MESSAGES/unicorecmsgem.po
Languages: swa_tz

source: What Is The Girl Effect
swa_tz: Girl Effect ni nini?

source: Title of story is placed here
swa_tz: Jifundishe zaidi kuhusu Girl Effect

source: Sub-heading comes here
swa_tz: Halafu eneza neno

source: Latest
swa_tz: Habari za hivi punde

source: More
swa_tz: Zaidi

source: The Girl Declaration
swa_tz: Azimio la msichana

source: Read It Now.
swa_tz: Soma sa hii

source: And share it with other girls
swa_tz: Na shiriki na wasichana wengine

source: Contact
swa_tz: Kuwasiliana

source: Terms &amp; Conditions
swa_tz: Sheria na Masharti

source: Tips on Use
swa_tz: Mawaidha ya matumizi

source: Home
swa_tz: Nyumbani
