Repository: universalcore/unicore-cms-ureport
Catalog: unicorecmsgem/locale/ind_*/LC_MESSAGES/unicorecmsgem.po
Languages: id

source: What Is The Girl Effect
id: Apakah Girl Effect itu?

source: Learn more about The Girl Effect
id: Pelajari lagi tentang Girl Effect

source: And spread the word
id: Dan menyebarkan berita

source: Latest
id: Terakhir

source: More
id: Lebih Banyak

source: The Girl Declaration
id: Deklarasi Anak Perempuan

source: Read It Now.
id: Baca Sekarang

source: And share it with other girls
id: Dan Ceritakan ke anak perempuan lain

source: Contact
id: Kontak

source: Terms &amp; Conditions
id: Ketentuan Penggunaan

source: Tips on Use
id: Kiat-kiat Penggunaan

source: Home
id: Beranda
