Repository: universalcore/unicore-cms-ureport
Catalog: unicorecmsgem/locale/fre_*/LC_MESSAGES/unicorecmsgem.po
Languages: fr

source: What Is The Girl Effect
fr: Qu'est-ce que Girl Effect

source: Learn more about The Girl Effect
fr: En savoir plus sur Girl Effect

source: And spread the word
fr: Et passer le mot

source: Latest
fr: Actualités

source: More
fr: Plus

source: The Girl Declaration
fr: La déclaration de filles

source: Read It Now.
fr: Lisez-le maintenant.

source: And share it with other girls
fr: Et partagez-le avec d'autres filles

source: Terms &amp; Conditions
fr: Conditions d'utilisation

source: Tips on Use
fr: Conseils d'utilisation

source: Home
fr: Accueil
